package com.anrudopis.simple_classes.task01;

/*
 * Создайте класс Test1 двумя переменными. Добавьте метод вывода на экран и методы изменения этих
 * переменных. Добавьте метод, который находит сумму значений этих переменных, и метод, который
 * находит наибольшее значение из этих двух переменных.
 */

public class Test01View {

    public void outToConsole(Test01 test) {
        System.out.println(test.toString());
    }
}
